awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F006xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP</name>
      <baseAddress>0x40010200</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CSR1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>COMP1_EN</name>
              <description>COMP1 enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INMSEL</name>
              <description>COMP1 negative input select</description>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>INPSEL</name>
              <description>COMP1 positive input select</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>WINMODE</name>
              <description>COMP1 window mode enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BLANKSEL</name>
              <description>Comparator 1 blanking signal selection</description>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>POLARITY</name>
              <description>COMP1 output polarity selection</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>HYST</name>
              <description>COMP1 hysteresis function enable control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>COMP1 power mode selection</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>INT_OUT_SEL</name>
              <description>COMP1 output to TIM/EXTI selection</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>COMP1_OUT</name>
              <description>COMP1 output status</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>COMP1_CSR registerlock</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FR1</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FLTEN1</name>
              <description>Comparator 1 digital filter configuration</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLTCNT1</name>
              <description>Comparator 1 sampling filter counter</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCSR</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>VREFCMP_EN</name>
              <description>VREFCMP voltage divider enable signal</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>VCDIV</name>
              <bitRange>[6:1]</bitRange>
            </field>
            <field>
              <name>SSEL</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR2</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>COMP2_EN</name>
              <description>COMP2 enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INMSEL</name>
              <description>COMP2 negative input select</description>
              <bitRange>[4:1]</bitRange>
            </field>
            <field>
              <name>INPSEL</name>
              <description>COMP2 positive input select</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>WINMODE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BLANKSEL</name>
              <description>Comparator 2 blanking signal selection</description>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>POLARITY</name>
              <description>COMP2 output polarity selection</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>HYST</name>
              <description>COMP1 hysteresis function enable control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>COMP2 power mode selection</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>INT_OUT_SEL</name>
              <description>COMP2 output to TIM/EXTI selection</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>COMP_OUT</name>
              <description>COMP2 output status</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>COMP2_CSR register lock</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FR2</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>FLTEN2</name>
              <description>Comparator 2 digital filtering configuration</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLTCNT2</name>
              <description>Comparator 2 sampling filter counter</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
