awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F006xx.svd
        <register>
          <name>EMR</name>
          <description>EXTI CPU wakeup with event maskregister</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>EM0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EM1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EM2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EM3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EM4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EM5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EM6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EM7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EM8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EM9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EM10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EM11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>EM12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EM13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EM14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EM15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EM16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EM17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EM18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EM20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EM22</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EM24</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>EM25</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>EM27</name>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH</name>
      <description>Flash</description>
      <baseAddress>0x40022000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLASH</name>
        <description>FLASH global Interrupt</description>
        <value>3</value>
      </interrupt>
      <registers>
        <register>
          <name>ACR</name>
          <description>Access control register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>LATENCY</name>
              <description>Latency</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYR</name>
          <description>Flash key register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>KEY</name>
              <description>Flash CR key</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTKEYR</name>
          <description>Option byte key register</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>OPTKEY</name>
              <description>Flash Option key</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>EOP</name>
              <description>End of operation</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WRPERR</name>
              <description>Write protection error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RDERR</name>
              <description>Bank pcrop read error</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OPTVERR</name>
              <description>Option and trimming bits loading validity error</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>BSY</name>
              <description>Bank Busy</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>USERLOCK</name>
              <description>User data lock</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>Flash control register</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>PG</name>
              <description>Page Program</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PER</name>
              <description>Page Erase</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MER</name>
              <description>Bank Mass Erase</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>UPG</name>
              <description>Userdata Program</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UPER</name>
              <description>Userdata Page Erase</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SER</name>
              <description>Sector Erase</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OPTSTRT</name>
              <description>Option bytes Programming Start</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>UPGSTRT</name>
              <description>Userdata Programming Start</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>PGSTRT</name>
              <description>Programming Start</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>RDERRIE</name>
              <description>Bank pcrop read error interrupt enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EOPIE</name>
              <description>End of operation interrupt enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ERRIE</name>
              <description>Error interrupt enable</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>OBL_LAUNCH</name>
              <description>Force the option bytes loading</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SECPROT</name>
              <description>Secure protect</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>OPTLOCK</name>
              <description>Option Lock</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTR</name>
          <description>Flash option register</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>RDP</name>
              <description>Read Protection</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NRST_MODE</name>
              <description>nrst mode</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IWDG_STOP</name>
              <description>IWDG Stop Count Control</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>IWDG_SW</name>
              <description>IWDG Software Enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>WWDG_SW</name>
              <description>WWDG Software Enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>NBOOT1</name>
              <description>nboot1</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>BOOT_LOCK</name>
              <description>Boot Lock</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>BOR_EN</name>
              <description>BOR enable</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BOR_OPCR</name>
              <description>BOR Level</description>
              <bitRange>[24:22]</bitRange>
            </field>
            <field>
              <name>SWD_MODE</name>
              <description>SWD mode</description>
              <bitRange>[26:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WRPR</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>BK_WRPX</name>
              <description>Bank Sector Write Protection</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCROPR</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>PCROPSR</name>
              <description>Bank pcrop start address</description>
              <bitRange>[8:0]</bitRange>
            </field>
            <field>
              <name>PCROPER</name>
              <description>Bank pcrop end address</description>
              <bitRange>[24:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SECR</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>SEC_SIZE</name>
              <description>Bank securable seize</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LPCR</name>
          <addressOffset>0x90</addressOffset>
          <fields>
            <field>
              <name>SLEEP_EN</name>
              <description>Sleep enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SLEEP_TIME</name>
              <description>Sleep time</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>LPRUN_ENTERT</name>
              <description>Low power run mode enter time</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>LPRUN_EXITT</name>
              <description>Low power run mode exit time</description>
              <bitRange>[22:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS0</name>
          <description>Flash TS0 register</description>
          <addressOffset>0x100</addressOffset>
          <fields>
            <field>
              <name>TS0</name>
              <description>TS0</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS1</name>
          <description>Flash TS1 register</description>
          <addressOffset>0x104</addressOffset>
          <fields>
            <field>
              <name>TS1</name>
              <description>TS1</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS2P</name>
          <description>Flash TS2P register</description>
          <addressOffset>0x108</addressOffset>
          <fields>
            <field>
              <name>TS2P</name>
              <description>TS2P</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TPS3</name>
          <description>Flash TPS3 register</description>
          <addressOffset>0x10C</addressOffset>
          <fields>
            <field>
              <name>TPS3</name>
              <description>TPS3</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS3</name>
          <description>Flash TS3 register</description>
          <addressOffset>0x110</addressOffset>
          <fields>
            <field>
              <name>TS3</name>
              <description>TS3</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ERSTPE</name>
          <addressOffset>0x114</addressOffset>
          <fields>
            <field>
              <name>ERSTPE</name>
              <description>ERSTPE</description>
              <bitRange>[14:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRGTPE</name>
          <description>Flash PRGTPE register</description>
          <addressOffset>0x118</addressOffset>
          <fields>
            <field>
              <name>PRGTPE</name>
              <description>PRGTPE</description>
              <bitRange>[14:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRETPE</name>
          <description>Flash PRETPE register</description>
          <addressOffset>0x11C</addressOffset>
          <fields>
            <field>
              <name>PRETPE</name>
              <description>PRETPE</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TACLK2PW</name>
          <addressOffset>0x120</addressOffset>
          <fields>
            <field>
              <name>TACLK2PW</name>
              <description>TACLK2PW</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
