awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F006xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOB</name>
      <baseAddress>0x50000400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOF</name>
      <baseAddress>0x50001400</baseAddress>
    </peripheral>
    <peripheral>
      <name>I2C1</name>
      <description>Inter integrated circuit</description>
      <groupName>I2C</groupName>
      <baseAddress>0x40005400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>I2C1</name>
        <description>I2C1 global Interrupt</description>
        <value>23</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <description>Control register 1</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>PE</name>
              <description>Peripheral enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WUPEN</name>
              <description>Wakeup from Stop mode enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ENGC</name>
              <description>General call enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>NOSTRETCH</name>
              <description>Clock stretching disable (Slave mode)</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>START</name>
              <description>Start generation</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>STOP</name>
              <description>Stop generation</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ACK</name>
              <description>Acknowledge enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>POS</name>
              <description>Acknowledge(for data reception)</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software reset</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>WKUP_DIV</name>
              <description>PCLK division</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>WKUP_CNT</name>
              <description>Timeout count number</description>
              <bitRange>[19:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>Control register 2</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FREQ</name>
              <description>Peripheral clock frequency</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>ITERREN</name>
              <description>Error interrupt enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA requests enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LAST</name>
              <description>DMA last transfer</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SBIE</name>
              <description>Start bit (Master mode) interrupt enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADDRIE</name>
              <description>Address sent (master mode)/matched (slave mode) interrupt enable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>BTFIE</name>
              <description>Byte transfer finished interrupt enable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADD10IE</name>
              <description>10-bit header sent (Master mode) interrupt enable</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>STOPIE</name>
              <description>Stop detection (slave mode) interrupt enable</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>RXIE</name>
              <description>Data register not empty (receivers) interrupt enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>TXIE</name>
              <description>Data register empty (transmitters) interrupt enable</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OAR1</name>
          <description>Own address register 1</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>ADD</name>
              <description>Interface address</description>
              <bitRange>[9:0]</bitRange>
            </field>
            <field>
              <name>ADDMODE</name>
              <description>Addressing mode (slave mode)</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OAR2</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>ENDUAL</name>
              <description>Dual addressing mode enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADD2</name>
              <description>Interface address</description>
              <bitRange>[7:1]</bitRange>
            </field>
            <field>
              <name>OA2MSK</name>
              <description>Own Address 2 masks</description>
              <bitRange>[10:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>Data register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>DR</name>
              <description>8-bit data register</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR1</name>
          <description>Status register 1</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>SB</name>
              <description>Start bit (Master mode)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDR</name>
              <description>Address sent (master mode)/matched (slave mode)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTF</name>
              <description>Byte transfer finished</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ADD10</name>
              <description>10-bit header sent (Master mode)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STOPF</name>
              <description>Stop detection (slave mode)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXNE</name>
              <description>Data register not empty (receivers)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXE</name>
              <description>Data register empty (transmitters)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BERR</name>
              <description>Bus error</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ARLO</name>
              <description>Arbitration lost (master mode)</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AF</name>
              <description>Acknowledge failure</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OVR</name>
              <description>Overrun/Underrun</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>Timeout or Tlow error</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR2</name>
          <description>Status register 2</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>MSL</name>
              <description>Master/slave</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Bus busy</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRA</name>
              <description>Transmitter/receiver</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GENCALL</name>
              <description>General call address (Slave mode)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DUALF</name>
              <description>Dual flag (Slave mode)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SBUSY</name>
              <description>Slave busy</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>Clock control register</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>CCR</name>
              <description>Clock control register in Fm/Sm mode (Master mode)</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>FP</name>
              <description>I2C master mode selection</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>DUTY</name>
              <description>Fm mode duty cycle</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FS</name>
              <description>I2C master mode selection</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISE</name>
          <description>TRISE register</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>TRISE</name>
              <description>Maximum rise time in Fm+/Fm/Sm mode (Master mode)</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>THOLDDATA</name>
              <description>Data hold time</description>
              <bitRange>[11:7]</bitRange>
            </field>
            <field>
              <name>THOLDDATA_SEL</name>
              <description>Data hold time select</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OAR3</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>ENTRIPLE</name>
              <description>Triple addressing mode enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADD3</name>
              <description>Interface address</description>
              <bitRange>[7:1]</bitRange>
            </field>
          </fields>
        </register>
