awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F006xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OPA</name>
      <description>Operational amplifier</description>
      <baseAddress>0x40010300</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OCR1</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>OPA1_EXTOEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OPA_VBIAS</name>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>OPA1_VMSEL</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>OPA1_VBSEL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>OPA1_PGA_GAIN</name>
              <bitRange>[11:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>OPA1EN</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OCR2</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>OPA2_EXTOEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OPA2_VMSEL</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>OPA2_VBSEL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>OPA2_PGA_GAIN</name>
              <bitRange>[11:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>OPA2EN</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>Power control</description>
      <baseAddress>0x40007000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <description>Power control register 1</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>LPMS</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>DBP</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>VR_MODE</name>
              <bitRange>[10:9]</bitRange>
            </field>
            <field>
              <name>FLS_SLPTIME</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MR_VSEL</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>LPR_VSEL</name>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>DLPR_VSEL</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>FLSSLP_CTRL</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>HSION_CTRL</name>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>Power control register 2</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>PVDE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PVDT</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>PVD_OUT_SEL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FLTEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FLT_TIME</name>
              <bitRange>[11:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Power status register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>MR_RDY</name>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LPRUN_RUN_SWF</name>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PVDO</name>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RCC</name>
      <description>Reset and clock control</description>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RCC</name>
        <description>RCC global Interrupt</description>
        <value>4</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>Clock control register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>HSION</name>
              <description>HSI clock enable bit</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>HSIRDY</name>
              <description>HSI clock ready logo</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSIDIV</name>
              <description>HSI generates the crossover factor when HSISYS clocks</description>
              <bitRange>[13:11]</bitRange>
            </field>
            <field>
              <name>HSEON</name>
              <description>HSE crystal oscillator enabled</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>HSERDY</name>
              <description>HSE crystal clock ready logo</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSEBYP</name>
              <description>HSE shields the crystal oscillator and selects the pin input clock</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>HSE_CSSON</name>
              <description>HSE clock security system enabled</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>PLLON</name>
              <description>PLL clock enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>PLLRDY</name>
              <description>PLL clock ready</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PLLDIV</name>
              <description>PLL div</description>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICSCR</name>
          <description>Internal clock sources calibrationregister</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>HSI_ABS_TRIM</name>
              <description>Clock frequency abs calibration value</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>HSI_TC_TRIM</name>
              <description>Clock frequency tc calibration value</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>HSI_FS</name>
              <description>HSI frequency selection</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>LSI_TRIM</name>
              <description>Internal low-speed clock frequency calibration</description>
              <bitRange>[27:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <description>Clock configuration register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>SW</name>
              <description>System clock source selection</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>SWS</name>
              <description>System clock source selection</description>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>HPRE</name>
              <description>The AHB clock HCLK is based on the crossover coefficient of SYSCLK</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>PPRE</name>
              <description>APB clock division factor</description>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>MCOSEL</name>
              <description>MCO output clock selection</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>MCOPRE</name>
              <description>Microprocessor output clock (MCO) divider factor</description>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCFGR</name>
          <description>PLL configuration register</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>PLLSRC</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PLLMUL</name>
              <bitRange>[6:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ECSCR</name>
          <description>External clock source control register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>HSE_DRV</name>
              <description>HSE drive capability setting</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>HSE_RDYSEL</name>
              <description>HSE stabilization time selection</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>HSE_FILT_EN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LSE_DRIVER</name>
              <description>LSE drive capability setting</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>LSE_STARTUP</name>
              <description>LSE crystal oscillator stabilization time selection</description>
              <bitRange>[21:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CIER</name>
          <description>Clock interrupt enableregister</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>LSIRDYIE</name>
              <description>LSI clock ready interrupt enabled</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSERDYIE</name>
              <description>LSE clock ready interrupt enabled</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HSIRDYIE</name>
              <description>HSI clock ready interrupt enabled</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HSERDYIE</name>
              <description>HSE clock ready interrupt enabled</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PLLRDYIE</name>
              <description>PLL clock ready interrupt enabled</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CIFR</name>
          <description>Clock interrupt flag register</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>LSIRDYF</name>
              <description>LSI clock ready interrupt flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LSERDYF</name>
              <description>LSE clock ready interrupt flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSIRDYF</name>
              <description>HSI clock ready interrupt flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSERDYF</name>
              <description>HSE clock ready interrupt flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PLLRDYF</name>
              <description>PLL clock ready interrupt flag</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CSSF</name>
              <description>HSE Clock Security System (CSS) interrupt flag</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LSECSSF</name>
              <description>LSE Clock Security System (CSS) interrupt flag</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CICR</name>
          <description>Clock interrupt clear register</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>LSIRDYC</name>
              <description>The LSI ready interrupt flag is cleared</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSERDYC</name>
              <description>The LSE ready interrupt flag is cleared</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HSIRDYC</name>
              <description>The HSI ready interrupt flag is cleared to zero</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HSERDYC</name>
              <description>The HSE ready interrupt flag is cleared to zero</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PLLRDYC</name>
              <description>The PLL ready interrupt flag is cleared to zero</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CSSC</name>
              <description>The HSE Clock Security System (CSS) interrupt flag is cleared to zero</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LSECSSC</name>
              <description>The LSE Clock Security System (CSS) interrupt flag is cleared</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOPRSTR</name>
          <description>GPIO reset register</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>GPIOARST</name>
              <description>I/O PortA reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GPIOBRST</name>
              <description>I/O PortB reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GPIOFRST</name>
              <description>I/O PortF reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBRSTR</name>
          <description>AHB peripheral reset register</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>DMARST</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CRCRST</name>
              <description>The CRC module is reset</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBRSTR1</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>TIM3RST</name>
              <description>The Timer3 module APB is reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RTCAPBRST</name>
              <description>The RTC module APB is reset</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>WWDGRST</name>
              <description>The WWDG module is reset</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI2RST</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>UART1RST</name>
              <description>The UART2 module is reset</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>LPUART1RST</name>
              <description>The LPUART1 module is reset</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C1RST</name>
              <description>The I2C1 module is reset</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OPA1RST</name>
              <description>The OPA1 module is reset</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>OPA2RST</name>
              <description>The OPA2 module is reset</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DBGRST</name>
              <description>The MCU Debug module is reset</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PWRRST</name>
              <description>The Power interface module is reset.</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>LPTIM1RST</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBRSTR2</name>
          <description>APB peripheral reset register2</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>SYSCFGRST</name>
              <description>The SYSCFG module is reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIM1RST</name>
              <description>The TIM1 module is reset</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1RST</name>
              <description>The SPI1 module is reset</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>USART1RST</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TIM14RST</name>
              <description>The TIM14 module is reset</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TIM16RST</name>
              <description>The TIM16 module is reset</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TIM17RST</name>
              <description>The TIM17 module is reset</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCRST</name>
              <description>The ADC block is reset</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>COMP1RST</name>
              <description>The COMP1 module is reset</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>COMP2RST</name>
              <description>The COMP2 module is reset</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>VREFBUFRST</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOPENR</name>
          <description>GPIO clock enable register</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>GPIOAEN</name>
              <description>I/O PortA clock enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GPIOBEN</name>
              <description>I/O PortB clock enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GPIOFEN</name>
              <description>I/O PortF clock enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
